UBC-Thunderbots/mrftest-old/firmware/stm32lib/include/registers.h
#ifndef STM32LIB_REGISTERS_H
#define STM32LIB_REGISTERS_H

#include <stdint.h>

/**
 * \cond INTERNAL_SYMBOLS
 */
#define BIT(name, position) \
	static const unsigned int name ## _SHIFT __attribute__((unused)) = (position); \
	static const uint32_t name __attribute__((unused)) = 1 << (position);

#define BITS(name, position, length) \
	static const unsigned int name ## _SHIFT __attribute__((unused)) = (position); \
	static const uint32_t name ## _MSKU __attribute__((unused)) = (1 << (length)) - 1; \
	static const uint32_t name ## _MSK __attribute__((unused)) = ((1 << (length)) - 1) << (position); \
	static uint32_t name(uint32_t value) __attribute__((unused)); \
	static uint32_t name(uint32_t value) { return value << (position); } \
	static uint32_t name ## _X(uint32_t value) __attribute__((unused)); \
	static uint32_t name ## _X(uint32_t value) { return (value >> (position)) & name ## _MSKU ; }

#define BITSS(name, position, width) \
	static unsigned int name ## _SHIFT(unsigned int i) __attribute__((unused)); \
	static unsigned int name ## _SHIFT(unsigned int i) { return (position) + i * (width); } \
	static uint32_t name ## _MSKU(unsigned int i) __attribute__((unused)); \
	static uint32_t name ## _MSKU(unsigned int i __attribute__((unused))) { return (1 << (width)) - 1; } \
	static uint32_t name ## _MSK(unsigned int i) __attribute__((unused)); \
	static uint32_t name ## _MSK(unsigned int i) { return name ## _MSKU(i) << name ## _SHIFT(i); } \
	static uint32_t name(unsigned int i, uint32_t value) __attribute__((unused)); \
	static uint32_t name(unsigned int i, uint32_t value) { return value << name ## _SHIFT(i); } \
	static uint32_t name ## _X(unsigned int i, uint32_t value) __attribute__((unused)); \
	static uint32_t name ## _X(unsigned int i, uint32_t value) { return (value >> name ## _SHIFT(i)) & name ## _MSKU(i); }
/**
 * \endcond
 */



extern volatile uint32_t OTG_FS_GOTGCTL;
BIT(SRQSCS, 0)
BIT(SRQ, 1)
BIT(HNGSCS, 8)
BIT(HNPRQ, 9)
BIT(HSHNPEN, 10)
BIT(DHNPEN, 11)
BIT(CIDSTS, 16)
BIT(DBCT, 17)
BIT(ASVLD, 18)
BIT(BSVLD, 19)

extern volatile uint32_t OTG_FS_GOTGINT;
BIT(SEDET, 2)
BIT(SRSSCHG, 8)
BIT(HNSSCHG, 9)
BIT(HNGDET, 17)
BIT(ADTOCHG, 18)
BIT(DBCDNE, 19)

extern volatile uint32_t OTG_FS_GAHBCFG;
BIT(GINTMSK, 0)
BIT(TXFELVL, 7)
BIT(PTXFELVL, 8)

extern volatile uint32_t OTG_FS_GUSBCFG;
BITS(TOCAL, 0, 3)
BIT(PHYSEL, 6)
BIT(SRPCAP, 8)
BIT(HNPCAP, 9)
BITS(TRDT, 10, 4)
BIT(FHMOD, 29)
BIT(FDMOD, 30)
BIT(CTXPKT, 31)

extern volatile uint32_t OTG_FS_GRSTCTL;
BIT(CSRST, 0)
BIT(HSRST, 1)
BIT(FCRST, 2)
BIT(RXFFLSH, 4)
BIT(TXFFLSH, 5)
BITS(GRSTCTL_TXFNUM, 6, 5)
BIT(AHBIDL, 31)

extern volatile uint32_t OTG_FS_GINTSTS;
BIT(CMOD, 0)
BIT(MMIS, 1)
BIT(OTGINT, 2)
BIT(SOF, 3)
BIT(RXFLVL, 4)
BIT(NPTXFE, 5)
BIT(GINAKEFF, 6)
BIT(GOUTNAKEFF, 7)
BIT(ESUSP, 10)
BIT(USBSUSP, 11)
BIT(USBRST, 12)
BIT(ENUMDNE, 13)
BIT(ISOODRP, 14)
BIT(EOPF, 15)
BIT(GINTSTS_IEPINT, 18)
BIT(GINTSTS_OEPINT, 19)
BIT(IISOIXFR, 20)
BIT(IPXFR, 21)
BIT(INCOMPISOOUT, 21)
BIT(HPRTINT, 24)
BIT(HCINT, 25)
BIT(PTXFE, 26)
BIT(CIDSCHG, 28)
BIT(DISCINT, 29)
BIT(SRQINT, 30)
BIT(WKUINT, 31)

extern volatile uint32_t OTG_FS_GINTMSK;
BIT(MMISM, 1)
//BIT(OTGINT, 2)
BIT(SOFM, 3)
BIT(RXFLVLM, 4)
BIT(NPTXFEM, 5)
BIT(GINAKEFFM, 6)
BIT(GONAKEFFM, 7)
BIT(ESUSPM, 10)
BIT(USBSUSPM, 11)
BIT(USBRSTM, 12)
BIT(ENUMDNEM, 13)
BIT(ISOODRPM, 14)
BIT(EOPFM, 15)
BIT(EPMISM, 17)
BIT(GINTMSK_IEPINT, 18)
BIT(GINTMSK_OEPINT, 19)
BIT(IISOIXFRM, 20)
BIT(IPXFRM, 21)
BIT(IISOOXFRM, 21)
BIT(PRTIM, 24)
BIT(HCIM, 25)
BIT(PTXFEM, 26)
BIT(CIDSCHGM, 28)
//BIT(DISCINT, 29)
BIT(SRQIM, 30)
BIT(WUIM, 31)

extern volatile uint32_t OTG_FS_GRXSTSR;
extern volatile uint32_t OTG_FS_GRXSTSP;
BITS(CHNUM, 0, 4)
BITS(BCNT, 4, 11)
BITS(GRXSTSP_DPID, 15, 2)
BITS(PKTSTS, 17, 4)
BITS(GRXSTSP_EPNUM, 0, 4)
//BITS(BCNT, 4, 11)
//BITS(GRXSTSP_DPID, 15, 2)
//BITS(PKTSTS, 17, 4)
BITS(FRMNUM, 21, 4)

extern volatile uint32_t OTG_FS_GRXFSIZ;
BITS(RXFD, 0, 16)

extern volatile uint32_t OTG_FS_HNPTXFSIZ;
BITS(NPTXFSA, 0, 16)
BITS(NPTXFD, 16, 16)

extern volatile uint32_t OTG_FS_DIEPTXF0;
BITS(TX0FSA, 0, 16)
BITS(TX0FD, 16, 16)

extern volatile uint32_t OTG_FS_HNPTXSTS;
BITS(NPTXFSAV, 0, 16)
BITS(NPTQXSAV, 16, 8)
BITS(NPTXQTOP, 24, 7)

extern volatile uint32_t OTG_FS_GCCFG;
BIT(PWRDWN, 16)
BIT(VBUSASEN, 18)
BIT(VBUSBSEN, 19)
BIT(SOFOUTEN, 20)
BIT(NOVBUSSENS, 21)

extern volatile uint32_t OTG_FS_CID;

extern volatile uint32_t OTG_FS_HPTXFSIZ;
BITS(PTXSA, 0, 16)
BITS(PTXFD, 16, 16)

extern volatile uint32_t OTG_FS_DIEPTXF1;
extern volatile uint32_t OTG_FS_DIEPTXF2;
extern volatile uint32_t OTG_FS_DIEPTXF3;
BITS(INEPTXSA, 0, 16)
BITS(INEPTXFD, 16, 16)

extern volatile uint32_t OTG_FS_HCFG;
BITS(FSLSPCS, 0, 2)
BIT(FSLSS, 2)

extern volatile uint32_t OTG_FS_HFIR;
BITS(FRIVL, 0, 16)

extern volatile uint32_t OTG_FS_HFNUM;
BITS(FRNUM, 0, 16)
BITS(FTREM, 16, 16)

extern volatile uint32_t OTG_FS_HPTXSTS;
BITS(PTXFSAVL, 0, 16)
BITS(PTXQSAV, 16, 8)
BITS(PTXQTOP, 24, 8)

extern volatile uint32_t OTG_FS_HAINT;
BITS(HAINT, 0, 16)

extern volatile uint32_t OTG_FS_HAINTMSK;
BITS(HAINTM, 0, 16)

extern volatile uint32_t OTG_FS_HPRT;
BIT(PCSTS, 0)
BIT(PCDET, 1)
BIT(PENA, 2)
BIT(PENCHNG, 3)
BIT(POCA, 4)
BIT(POCCHNG, 5)
BIT(PRES, 6)
BIT(PSUSP, 7)
BIT(PRST, 8)
BITS(PLSTS, 10, 2)
BIT(PPWR, 12)
BITS(PTCTL, 13, 4)
BITS(PSPD, 17, 2)

extern volatile uint32_t OTG_FS_HCCHAR0;
extern volatile uint32_t OTG_FS_HCCHAR1;
extern volatile uint32_t OTG_FS_HCCHAR2;
extern volatile uint32_t OTG_FS_HCCHAR3;
extern volatile uint32_t OTG_FS_HCCHAR4;
extern volatile uint32_t OTG_FS_HCCHAR5;
extern volatile uint32_t OTG_FS_HCCHAR6;
extern volatile uint32_t OTG_FS_HCCHAR7;
BITS(MPSIZ, 0, 11)
BITS(HCCHAR_EPNUM, 11, 4)
BIT(EPDIR, 15)
BIT(LSDEV, 17)
BITS(EPTYP, 18, 2)
BITS(HCCHAR_MCNT, 20, 2)
BITS(HCCHAR_DAD, 22, 7)
BIT(ODDFRM, 29)
BIT(CHDIS, 30)
BIT(CHENA, 31)

extern volatile uint32_t OTG_FS_HCINT0;
extern volatile uint32_t OTG_FS_HCINT1;
extern volatile uint32_t OTG_FS_HCINT2;
extern volatile uint32_t OTG_FS_HCINT3;
extern volatile uint32_t OTG_FS_HCINT4;
extern volatile uint32_t OTG_FS_HCINT5;
extern volatile uint32_t OTG_FS_HCINT6;
extern volatile uint32_t OTG_FS_HCINT7;
BIT(XFRC, 0)
BIT(CHH, 1)
BIT(HCINT_STALL, 3)
BIT(NAK, 4)
BIT(ACK, 5)
BIT(TXERR, 7)
BIT(BBERR, 8)
BIT(FRMOR, 9)
BIT(DTERR, 10)

extern volatile uint32_t OTG_FS_HCINTMSK0;
extern volatile uint32_t OTG_FS_HCINTMSK1;
extern volatile uint32_t OTG_FS_HCINTMSK2;
extern volatile uint32_t OTG_FS_HCINTMSK3;
extern volatile uint32_t OTG_FS_HCINTMSK4;
extern volatile uint32_t OTG_FS_HCINTMSK5;
extern volatile uint32_t OTG_FS_HCINTMSK6;
extern volatile uint32_t OTG_FS_HCINTMSK7;
BIT(XFRCM, 0)
BIT(CHHM, 1)
BIT(STALLM, 3)
BIT(NAKM, 4)
BIT(ACKM, 5)
BIT(NYET, 6)
BIT(TXERRM, 7)
BIT(BBERRM, 8)
BIT(FRMORM, 9)
BIT(DTERRM, 10)

extern volatile uint32_t OTG_FS_HCTSIZ0;
extern volatile uint32_t OTG_FS_HCTSIZ1;
extern volatile uint32_t OTG_FS_HCTSIZ2;
extern volatile uint32_t OTG_FS_HCTSIZ3;
extern volatile uint32_t OTG_FS_HCTSIZ4;
extern volatile uint32_t OTG_FS_HCTSIZ5;
extern volatile uint32_t OTG_FS_HCTSIZ6;
extern volatile uint32_t OTG_FS_HCTSIZ7;
BITS(XFRSIZ, 0, 19)
BITS(PKTCNT, 19, 10)
BITS(HCTSIZ_DPID, 29, 2)

