UBC-Thunderbots/mrftest-old/firmware/stm32lib/include/registers.h
extern volatile uint32_t OTG_FS_DCFG;
BITS(DSPD, 0, 2)
BIT(NZLSOHSK, 2)
BITS(DCFG_DAD, 4, 7)
BITS(PFILVL, 11, 2)

extern volatile uint32_t OTG_FS_DCTL;
BIT(RWUSIG, 0)
BIT(SDIS, 1)
BIT(GINSTS, 2)
BIT(GONSTS, 3)
BITS(TCTL, 4, 3)
BIT(SGINAK, 7)
BIT(CGINAK, 8)
BIT(SGONAK, 9)
BIT(CGONAK, 10)
BIT(POPRGDNE, 11)

extern volatile uint32_t OTG_FS_DSTS;
BIT(SUSPSTS, 0)
BITS(ENUMSPD, 1, 2)
BIT(EERR, 3)
BITS(FNSOF, 8, 14)

extern volatile uint32_t OTG_FS_DIEPMSK;
//BIT(XFRCM, 0)
BIT(EPDM, 1)
BIT(TOM, 3)
BIT(ITTXFEMSK, 4)
BIT(INEPNMM, 5)
BIT(INEPNEM, 6)

extern volatile uint32_t OTG_FS_DOEPMSK;
//BIT(XFRCM, 0)
//BIT(EPDM, 1)
BIT(STUPM, 3)
BIT(OTEPDM, 4)

extern volatile uint32_t OTG_FS_DAINT;
BITS(DAINT_IEPINT, 0, 16)
BITS(DAINT_OEPINT, 16, 16)

extern volatile uint32_t OTG_FS_DAINTMSK;
BITS(IEPM, 0, 16)
BITS(OEPM, 16, 16)

extern volatile uint32_t OTG_FS_DVBUSDIS;
BITS(VBUSDT, 0, 16)

extern volatile uint32_t OTG_FS_DVBUSPULSE;
BITS(DVBUSP, 0, 12)

extern volatile uint32_t OTG_FS_DIEPEMPMSK;
BITS(INEPTXFEM, 0, 16)

extern volatile uint32_t OTG_FS_DIEPCTL0;
extern volatile uint32_t OTG_FS_DIEPCTL1;
extern volatile uint32_t OTG_FS_DIEPCTL2;
extern volatile uint32_t OTG_FS_DIEPCTL3;
//BITS(MPSIZ, 0, 11)
BIT(USBAEP, 15)
BIT(EONUM, 16)
BIT(DPID, 16)
BIT(NAKSTS, 17)
//BITS(EPTYP, 18, 2)
BIT(DIEPCTL_STALL, 21)
BITS(DIEPCTL_TXFNUM, 22, 4)
BIT(CNAK, 26)
BIT(SNAK, 27)
BIT(SD0PID, 28)
BIT(SEVNFRM, 28)
BIT(SODDFRM, 29)
BIT(EPDIS, 30)
BIT(EPENA, 31)

extern volatile uint32_t OTG_FS_DTXFSTS0;
extern volatile uint32_t OTG_FS_DTXFSTS1;
extern volatile uint32_t OTG_FS_DTXFSTS2;
extern volatile uint32_t OTG_FS_DTXFSTS3;
BITS(INEPTFSAV, 0, 16)

extern volatile uint32_t OTG_FS_DOEPCTL0;
extern volatile uint32_t OTG_FS_DOEPCTL1;
extern volatile uint32_t OTG_FS_DOEPCTL2;
extern volatile uint32_t OTG_FS_DOEPCTL3;
//BITS(MPSIZ, 0, 11)
//BIT(USBAEP, 15)
//BIT(EONUM, 16)
//BIT(DPID, 16)
//BIT(NAKSTS, 17)
//BITS(EPTYP, 18, 2)
BIT(SNPM, 20)
BIT(DOEPCTL_STALL, 21)
//BIT(CNAK, 26)
//BIT(SNAK, 27)
//BIT(SD0PID, 28)
//BIT(SEVNFRM, 28)
//BIT(SODDFRM, 29)
BIT(SD1PID, 29)
//BIT(EPDIS, 30)
//BIT(EPENA, 31)

extern volatile uint32_t OTG_FS_DIEPINT0;
extern volatile uint32_t OTG_FS_DIEPINT1;
extern volatile uint32_t OTG_FS_DIEPINT2;
extern volatile uint32_t OTG_FS_DIEPINT3;
//BIT(XFRC, 0)
BIT(EPDISD, 1)
BIT(TOC, 3)
BIT(ITTXFE, 4)
BIT(INEPNE, 6)
BIT(TXFE, 7)

extern volatile uint32_t OTG_FS_DOEPINT0;
extern volatile uint32_t OTG_FS_DOEPINT1;
extern volatile uint32_t OTG_FS_DOEPINT2;
extern volatile uint32_t OTG_FS_DOEPINT3;
//BIT(XFRC, 0)
//BIT(EPDISD, 1)
BIT(STUP, 3)
BIT(OTEPDIS, 4)
BIT(B2BSTUP, 6)

extern volatile uint32_t OTG_FS_DIEPTSIZ0;
extern volatile uint32_t OTG_FS_DIEPTSIZ1;
extern volatile uint32_t OTG_FS_DIEPTSIZ2;
extern volatile uint32_t OTG_FS_DIEPTSIZ3;
//BITS(XFRSIZ, 0, 19)
//BITS(PKTCNT, 19, 10)
BITS(DIEPTSIZ_MCNT, 29, 2)
BITS(STUPCNT, 29, 2)

extern volatile uint32_t OTG_FS_DOEPTSIZ0;
extern volatile uint32_t OTG_FS_DOEPTSIZ1;
extern volatile uint32_t OTG_FS_DOEPTSIZ2;
extern volatile uint32_t OTG_FS_DOEPTSIZ3;
//BITS(XFRSIZ, 0, 19)
//BITS(PKTCNT, 19, 10)
//BITS(STUPCNT, 29, 2)
BITS(RXDPID, 29, 2)

extern volatile uint32_t OTG_FS_PCGCCTL;
BIT(STPPCLK, 0)
BIT(GATEHCLK, 1)
BIT(PHYSUSP, 4)

extern volatile uint32_t OTG_FS_FIFO[4][0x1000 / 4];



extern volatile uint32_t FLASH_ACR;
BITS(LATENCY, 0, 3)
BIT(PRFTEN, 8)
BIT(ICEN, 9)
BIT(DCEN, 10)
BIT(ICRST, 11)
BIT(DCRST, 12)

extern volatile uint32_t FLASH_KEYR;
extern volatile uint32_t FLASH_OPTKEYR;

extern volatile uint32_t FLASH_SR;
BIT(EOP, 0)
BIT(OPERR, 1)
BIT(WRPERR, 4)
BIT(PGAERR, 5)
BIT(PGPERR, 6)
BIT(PGSERR, 7)
BIT(FLASH_SR_BSY, 16)

extern volatile uint32_t FLASH_CR;
BIT(PG, 0)
BIT(SER, 1)
BIT(MER, 2)
BITS(SNB, 3, 4)
BITS(PSIZE, 8, 2)
BIT(FLASH_CR_STRT, 16)
BIT(EOPIE, 24)
BIT(FLASH_CR_ERRIE, 25)
BIT(LOCK, 31)

extern volatile uint32_t FLASH_OPTCR;
BIT(OPTLOCK, 0)
BIT(OPTSTRT, 1)
BITS(BOR_LEV, 2, 2)
BIT(WDG_SW, 5)
BIT(NRST_STOP, 6)
BIT(NRST_STDBY, 7)
BITS(RDP, 8, 8)
BITS(NWRP, 16, 12)



extern volatile uint32_t RCC_CR;
BIT(HSION, 0)
BIT(HSIRDY, 1)
BITS(HSITRIM, 3, 5)
BITS(HSICAL, 8, 8)
BIT(HSEON, 16)
BIT(HSERDY, 17)
BIT(HSEBYP, 18)
BIT(CSSON, 19)
BIT(PLLON, 24)
BIT(PLLRDY, 25)
BIT(PLLI2SON, 26)
BIT(PLLI2SRDY, 27)

extern volatile uint32_t RCC_PLLCFGR;
BITS(PLLM, 0, 5)
BITS(PLLN, 6, 9)
BITS(PLLP, 16, 2)
BIT(PLLSRC, 22)
BITS(PLLQ, 24, 4)

extern volatile uint32_t RCC_CFGR;
BITS(SW, 0, 2)
BITS(SWS, 2, 2)
BITS(HPRE, 4, 4)
BITS(PPRE1, 10, 3)
BITS(PPRE2, 13, 3)
BITS(RTCPRE, 16, 5)
BITS(MCO1, 21, 2)
BIT(I2SSRC, 23)
BITS(MCO1PRE, 24, 3)
BITS(MCO2PRE, 27, 3)
BITS(MCO2, 30, 2)

extern volatile uint32_t RCC_CIR;
BIT(LSIRDYF, 0)
BIT(LSERDYF, 1)
BIT(HSIRDYF, 2)
BIT(HSERDYF, 3)
BIT(PLLRDYF, 4)
BIT(PLLI2SRDYF, 5)
BIT(CSSF, 7)
BIT(LSIRDYIE, 8)
BIT(LSERDYIE, 9)
BIT(HSIRDYIE, 10)
BIT(HSERDYIE, 11)
BIT(PLLRDYIE, 12)
BIT(PLLI2SRDYIE, 13)
BIT(LSIRDYC, 16)
BIT(LSERDYC, 17)
BIT(HSIRDYC, 18)
BIT(HSERDYC, 19)
BIT(PLLRDYC, 20)
BIT(PLLI2SRDYC, 21)
BIT(CSSC, 23)

extern volatile uint32_t RCC_AHB1RSTR;
extern volatile uint32_t RCC_AHB2RSTR;
extern volatile uint32_t RCC_AHB3RSTR;
extern volatile uint32_t RCC_APB1RSTR;
extern volatile uint32_t RCC_APB2RSTR;
extern volatile uint32_t RCC_AHB1ENR;
extern volatile uint32_t RCC_AHB2ENR;
extern volatile uint32_t RCC_AHB3ENR;
extern volatile uint32_t RCC_APB1ENR;
extern volatile uint32_t RCC_APB2ENR;
extern volatile uint32_t RCC_AHB1LPENR;
extern volatile uint32_t RCC_AHB2LPENR;
extern volatile uint32_t RCC_AHB3LPENR;
extern volatile uint32_t RCC_APB1LPENR;
extern volatile uint32_t RCC_APB2LPENR;

extern volatile uint32_t RCC_BDCR;
BIT(LSEON, 0)
BIT(LSERDY, 1)
BIT(LSEBYP, 2)
BITS(RTCSEL, 8, 2)
BIT(RTCEN, 15)
BIT(BDRST, 16)

extern volatile uint32_t RCC_CSR;
BIT(LSION, 0)
BIT(LSIRDY, 1)
BIT(RMVF, 24)
BIT(BORRSTF, 25)
BIT(PINRSTF, 26)
BIT(PORRSTF, 27)
BIT(SFTRSTF, 28)
BIT(IWDGRSTF, 29)
BIT(WWDGRSTF, 30)
BIT(LPWRRSTF, 31)

extern volatile uint32_t RCC_SSCGR;
BITS(MODPER, 0, 13)
BITS(INCSTEP, 13, 15)
BIT(SPREADSEL, 30)
BIT(SSCGEN, 31)

extern volatile uint32_t RCC_PLLI2SCFGR;
BITS(PLLI2SN, 6, 8)
BITS(PLLI2SR, 28, 3)



extern volatile uint32_t GPIOI_MODER;
extern volatile uint32_t GPIOI_OTYPER;
extern volatile uint32_t GPIOI_OSPEEDR;
extern volatile uint32_t GPIOI_PUPDR;
extern volatile uint32_t GPIOI_IDR;
extern volatile uint32_t GPIOI_ODR;
extern volatile uint32_t GPIOI_BSRR;
extern volatile uint32_t GPIOI_LCKR;
extern volatile uint32_t GPIOI_AFRL;
extern volatile uint32_t GPIOI_AFRH;

extern volatile uint32_t GPIOH_MODER;
extern volatile uint32_t GPIOH_OTYPER;
extern volatile uint32_t GPIOH_OSPEEDR;
extern volatile uint32_t GPIOH_PUPDR;
extern volatile uint32_t GPIOH_IDR;
extern volatile uint32_t GPIOH_ODR;
extern volatile uint32_t GPIOH_BSRR;
extern volatile uint32_t GPIOH_LCKR;
extern volatile uint32_t GPIOH_AFRL;
extern volatile uint32_t GPIOH_AFRH;

extern volatile uint32_t GPIOG_MODER;
extern volatile uint32_t GPIOG_OTYPER;
extern volatile uint32_t GPIOG_OSPEEDR;
extern volatile uint32_t GPIOG_PUPDR;
extern volatile uint32_t GPIOG_IDR;
extern volatile uint32_t GPIOG_ODR;
extern volatile uint32_t GPIOG_BSRR;
extern volatile uint32_t GPIOG_LCKR;
extern volatile uint32_t GPIOG_AFRL;
extern volatile uint32_t GPIOG_AFRH;

extern volatile uint32_t GPIOF_MODER;
extern volatile uint32_t GPIOF_OTYPER;
extern volatile uint32_t GPIOF_OSPEEDR;
extern volatile uint32_t GPIOF_PUPDR;
extern volatile uint32_t GPIOF_IDR;
extern volatile uint32_t GPIOF_ODR;
extern volatile uint32_t GPIOF_BSRR;
extern volatile uint32_t GPIOF_LCKR;
extern volatile uint32_t GPIOF_AFRL;
extern volatile uint32_t GPIOF_AFRH;

