UBC-Thunderbots/mrftest-old/firmware/stm32lib/include/registers.h
extern volatile uint32_t GPIOE_MODER;
extern volatile uint32_t GPIOE_OTYPER;
extern volatile uint32_t GPIOE_OSPEEDR;
extern volatile uint32_t GPIOE_PUPDR;
extern volatile uint32_t GPIOE_IDR;
extern volatile uint32_t GPIOE_ODR;
extern volatile uint32_t GPIOE_BSRR;
extern volatile uint32_t GPIOE_LCKR;
extern volatile uint32_t GPIOE_AFRL;
extern volatile uint32_t GPIOE_AFRH;

extern volatile uint32_t GPIOD_MODER;
extern volatile uint32_t GPIOD_OTYPER;
extern volatile uint32_t GPIOD_OSPEEDR;
extern volatile uint32_t GPIOD_PUPDR;
extern volatile uint32_t GPIOD_IDR;
extern volatile uint32_t GPIOD_ODR;
extern volatile uint32_t GPIOD_BSRR;
extern volatile uint32_t GPIOD_LCKR;
extern volatile uint32_t GPIOD_AFRL;
extern volatile uint32_t GPIOD_AFRH;

extern volatile uint32_t GPIOC_MODER;
extern volatile uint32_t GPIOC_OTYPER;
extern volatile uint32_t GPIOC_OSPEEDR;
extern volatile uint32_t GPIOC_PUPDR;
extern volatile uint32_t GPIOC_IDR;
extern volatile uint32_t GPIOC_ODR;
extern volatile uint32_t GPIOC_BSRR;
extern volatile uint32_t GPIOC_LCKR;
extern volatile uint32_t GPIOC_AFRL;
extern volatile uint32_t GPIOC_AFRH;

extern volatile uint32_t GPIOB_MODER;
extern volatile uint32_t GPIOB_OTYPER;
extern volatile uint32_t GPIOB_OSPEEDR;
extern volatile uint32_t GPIOB_PUPDR;
extern volatile uint32_t GPIOB_IDR;
extern volatile uint32_t GPIOB_ODR;
extern volatile uint32_t GPIOB_BSRR;
extern volatile uint32_t GPIOB_LCKR;
extern volatile uint32_t GPIOB_AFRL;
extern volatile uint32_t GPIOB_AFRH;

extern volatile uint32_t GPIOA_MODER;
extern volatile uint32_t GPIOA_OTYPER;
extern volatile uint32_t GPIOA_OSPEEDR;
extern volatile uint32_t GPIOA_PUPDR;
extern volatile uint32_t GPIOA_IDR;
extern volatile uint32_t GPIOA_ODR;
extern volatile uint32_t GPIOA_BSRR;
extern volatile uint32_t GPIOA_LCKR;
extern volatile uint32_t GPIOA_AFRL;
extern volatile uint32_t GPIOA_AFRH;

BITSS(MODER, 0, 2)
BITSS(OSPEEDR, 0, 2)
BITSS(PUPDR, 0, 2)
#define GPIO_BS(i) (1 << (i))
#define GPIO_BR(i) (1 << ((i) + 16))
BITSS(AFRL, 0, 4)
BITSS(AFRH, 0, 4)



extern volatile uint32_t EXTI_IMR;
extern volatile uint32_t EXTI_EMR;
extern volatile uint32_t EXTI_RTSR;
extern volatile uint32_t EXTI_FTSR;
extern volatile uint32_t EXTI_SWIER;
extern volatile uint32_t EXTI_PR;



extern volatile uint32_t SYSCFG_MEMRMP;
BITS(MEM_MODE, 0, 2)

extern volatile uint32_t SYSCFG_PMC;
BIT(MII_RMII_SEL, 23)

extern volatile uint32_t SYSCFG_EXTICR[4];

extern volatile uint32_t SYSCFG_CMPCR;
BIT(CMP_PD, 0)
BIT(READY, 8)



extern volatile uint32_t SPI1_CR1;
extern volatile uint32_t SPI2_CR1;
extern volatile uint32_t SPI3_CR1;
BIT(CPHA, 0)
BIT(CPOL, 1)
BIT(MSTR, 2)
BITS(BR, 3, 3)
BIT(SPE, 6)
BIT(LSBFIRST, 7)
BIT(SSI, 8)
BIT(SSM, 9)
BIT(RXONLY, 10)
BIT(DFF, 11)
BIT(CRCNEXT, 12)
BIT(CRCEN, 13)
BIT(BIDIOE, 14)
BIT(BIDIMODE, 15)

extern volatile uint32_t SPI1_CR2;
extern volatile uint32_t SPI2_CR2;
extern volatile uint32_t SPI3_CR2;
BIT(RXDMAEN, 0)
BIT(TXDMAEN, 1)
BIT(SSOE, 2)
BIT(FRF, 4)
BIT(SPI_ERRIE, 5)
BIT(RXNEIE, 6)
BIT(TXEIE, 7)

extern volatile uint32_t SPI1_SR;
extern volatile uint32_t SPI2_SR;
extern volatile uint32_t SPI3_SR;
BIT(RXNE, 0)
BIT(TXE, 1)
BIT(CHSIDE, 2)
BIT(UDR, 3)
BIT(CRCERR, 4)
BIT(MODF, 5)
BIT(SPI_OVR, 6)
BIT(SPI_BSY, 7)
BIT(FRE, 8)

extern volatile uint32_t SPI1_DR;
extern volatile uint32_t SPI2_DR;
extern volatile uint32_t SPI3_DR;

extern volatile uint32_t SPI1_CRCPR;
extern volatile uint32_t SPI2_CRCPR;
extern volatile uint32_t SPI3_CRCPR;

extern volatile uint32_t SPI1_RXCRCR;
extern volatile uint32_t SPI2_RXCRCR;
extern volatile uint32_t SPI3_RXCRCR;

extern volatile uint32_t SPI1_TXCRCR;
extern volatile uint32_t SPI2_TXCRCR;
extern volatile uint32_t SPI3_TXCRCR;

extern volatile uint32_t SPI1_I2SCFGR;
extern volatile uint32_t SPI2_I2SCFGR;
extern volatile uint32_t SPI3_I2SCFGR;
BIT(CHLEN, 0)
BITS(DATLEN, 1, 2)
BIT(CKPOL, 3)
BITS(I2SSTD, 4, 2)
BIT(PCMSYNC, 7)
BITS(I2SCFG, 8, 2)
BIT(I2SE, 10)
BIT(I2SMOD, 11)

extern volatile uint32_t SPI1_I2SPR;
extern volatile uint32_t SPI2_I2SPR;
extern volatile uint32_t SPI3_I2SPR;
BITS(I2SDIV, 0, 8)
BIT(ODD, 8)
BIT(MCKOE, 9)



extern volatile uint32_t ADC1_SR;
extern volatile uint32_t ADC2_SR;
extern volatile uint32_t ADC3_SR;
BIT(AWD, 0)
BIT(EOC, 1)
BIT(JEOC, 2)
BIT(JSTRT, 3)
BIT(ADC_STRT, 4)
BIT(ADC_OVR, 5)

extern volatile uint32_t ADC1_CR1;
extern volatile uint32_t ADC2_CR1;
extern volatile uint32_t ADC3_CR1;
BITS(AWDCH, 0, 5)
BIT(EOCIE, 5)
BIT(AWDIE, 6)
BIT(JEOCIE, 7)
BIT(SCAN, 8)
BIT(AWDSGL, 9)
BIT(JAUTO, 10)
BIT(DISCEN, 11)
BIT(JDISCEN, 12)
BITS(DISCNUM, 13, 3)
BIT(JAWDEN, 22)
BIT(AWDEN, 23)
BITS(RES, 24, 2)
BIT(OVRIE, 26)

extern volatile uint32_t ADC1_CR2;
extern volatile uint32_t ADC2_CR2;
extern volatile uint32_t ADC3_CR2;
BIT(ADON, 0)
BIT(CONT, 1)
BIT(ADCx_CR2_DMA, 8)
BIT(ADCx_CR2_DDS, 9)
BIT(EOCS, 10)
BIT(ALIGN, 11)
BITS(JEXTSEL, 16, 4)
BITS(JEXTEN, 20, 2)
BIT(JSWSTART, 22)
BITS(EXTSEL, 24, 4)
BITS(EXTEN, 28, 2)
BIT(SWSTART, 30)

extern volatile uint32_t ADC1_SMPR1;
extern volatile uint32_t ADC2_SMPR1;
extern volatile uint32_t ADC3_SMPR1;
extern volatile uint32_t ADC1_SMPR2;
extern volatile uint32_t ADC2_SMPR2;
extern volatile uint32_t ADC3_SMPR2;
BITSS(SMP, 0, 3)

extern volatile uint32_t ADC1_JOFR1;
extern volatile uint32_t ADC2_JOFR1;
extern volatile uint32_t ADC3_JOFR1;
extern volatile uint32_t ADC1_JOFR2;
extern volatile uint32_t ADC2_JOFR2;
extern volatile uint32_t ADC3_JOFR2;
extern volatile uint32_t ADC1_JOFR3;
extern volatile uint32_t ADC2_JOFR3;
extern volatile uint32_t ADC3_JOFR3;
extern volatile uint32_t ADC1_JOFR4;
extern volatile uint32_t ADC2_JOFR4;
extern volatile uint32_t ADC3_JOFR4;

extern volatile uint32_t ADC1_HTR;
extern volatile uint32_t ADC2_HTR;
extern volatile uint32_t ADC3_HTR;

extern volatile uint32_t ADC1_LTR;
extern volatile uint32_t ADC2_LTR;
extern volatile uint32_t ADC3_LTR;

extern volatile uint32_t ADC1_SQR1;
extern volatile uint32_t ADC2_SQR1;
extern volatile uint32_t ADC3_SQR1;
extern volatile uint32_t ADC1_SQR2;
extern volatile uint32_t ADC2_SQR2;
extern volatile uint32_t ADC3_SQR2;
extern volatile uint32_t ADC1_SQR3;
extern volatile uint32_t ADC2_SQR3;
extern volatile uint32_t ADC3_SQR3;
BITSS(ADC_SQR_SQ, 0, 5)
BITS(ADC_SQR1_L, 20, 4)

extern volatile uint32_t ADC1_JSQR;
extern volatile uint32_t ADC2_JSQR;
extern volatile uint32_t ADC3_JSQR;
BITSS(ADC_JSQ, 0, 5)
BITS(ADC_JL, 20, 2)

extern volatile uint32_t ADC1_JDR1;
extern volatile uint32_t ADC2_JDR1;
extern volatile uint32_t ADC3_JDR1;
extern volatile uint32_t ADC1_JDR2;
extern volatile uint32_t ADC2_JDR2;
extern volatile uint32_t ADC3_JDR2;
extern volatile uint32_t ADC1_JDR3;
extern volatile uint32_t ADC2_JDR3;
extern volatile uint32_t ADC3_JDR3;
extern volatile uint32_t ADC1_JDR4;
extern volatile uint32_t ADC2_JDR4;
extern volatile uint32_t ADC3_JDR4;

extern volatile uint32_t ADC1_DR;
extern volatile uint32_t ADC2_DR;
extern volatile uint32_t ADC3_DR;

