UBC-Thunderbots/mrftest-old/firmware/stm32lib/include/registers.h
extern volatile uint32_t ADC_CSR;
BIT(AWD1, 0)
BIT(EOC1, 1)
BIT(JEOC1, 2)
BIT(JSTRT1, 3)
BIT(STRT1, 4)
BIT(OVR1, 5)
BIT(AWD2, 8)
BIT(EOC2, 9)
BIT(JEOC2, 10)
BIT(JSTRT2, 11)
BIT(STRT2, 12)
BIT(OVR2, 13)
BIT(AWD3, 16)
BIT(EOC3, 17)
BIT(JEOC3, 18)
BIT(JSTRT3, 19)
BIT(STRT3, 20)
BIT(OVR3, 21)

extern volatile uint32_t ADC_CCR;
BITS(MULTI, 0, 5)
BITS(DELAY, 8, 4)
BIT(ADC_CCR_DDS, 13)
BITS(ADC_CCR_DMA, 14, 2)
BITS(ADCPRE, 16, 2)
BIT(VBATE, 22)
BIT(TSVREFE, 23)

extern volatile uint32_t ADC_CDR;



extern volatile uint32_t PWR_CR;
BIT(LPDS, 0)
BIT(PDDS, 1)
BIT(CWUF, 2)
BIT(CSBF, 3)
BIT(PVDE, 4)
BITS(PLS, 5, 3)
BIT(DBP, 8)
BIT(FPDS, 9)
BIT(VOS, 14)

extern volatile uint32_t PWR_CSR;
BIT(WUF, 0)
BIT(SBF, 1)
BIT(PVDO, 2)
BIT(BRR, 3)
BIT(EWUP, 8)
BIT(BRE, 9)
BIT(VOSRDY, 14)



extern volatile uint32_t TIM1_CR1;
extern volatile uint32_t TIM2_CR1;
extern volatile uint32_t TIM3_CR1;
extern volatile uint32_t TIM4_CR1;
extern volatile uint32_t TIM5_CR1;
extern volatile uint32_t TIM6_CR1;
extern volatile uint32_t TIM7_CR1;
extern volatile uint32_t TIM8_CR1;
extern volatile uint32_t TIM9_CR1;
extern volatile uint32_t TIM10_CR1;
extern volatile uint32_t TIM11_CR1;
extern volatile uint32_t TIM12_CR1;
extern volatile uint32_t TIM13_CR1;
extern volatile uint32_t TIM14_CR1;
BIT(CEN, 0)
BIT(UDIS, 1)
BIT(URS, 2)
BIT(OPM, 3)
BIT(DIR, 4)
BITS(CMS, 5, 2)
BIT(ARPE, 7)
BITS(CKD, 8, 2)

extern volatile uint32_t TIM1_CR2;
extern volatile uint32_t TIM2_CR2;
extern volatile uint32_t TIM3_CR2;
extern volatile uint32_t TIM4_CR2;
extern volatile uint32_t TIM5_CR2;
extern volatile uint32_t TIM6_CR2;
extern volatile uint32_t TIM7_CR2;
extern volatile uint32_t TIM8_CR2;
extern volatile uint32_t TIM9_CR2;
extern volatile uint32_t TIM12_CR2;
BIT(CCPC, 0)
BIT(CCUS, 2)
BIT(CCDS, 3)
BITS(MMS, 4, 3)
BIT(TI1S, 7)
BIT(OIS1, 8)
BIT(OIS1N, 9)
BIT(OIS2, 10)
BIT(OIS2N, 11)
BIT(OIS3, 12)
BIT(OIS3N, 13)
BIT(OIS4, 14)

extern volatile uint32_t TIM1_SMCR;
extern volatile uint32_t TIM2_SMCR;
extern volatile uint32_t TIM3_SMCR;
extern volatile uint32_t TIM4_SMCR;
extern volatile uint32_t TIM5_SMCR;
extern volatile uint32_t TIM8_SMCR;
extern volatile uint32_t TIM9_SMCR;
extern volatile uint32_t TIM12_SMCR;
BITS(SMS, 0, 3)
BITS(TS, 4, 3)
BIT(MSM, 7)
BITS(ETF, 8, 4)
BITS(ETPS, 12, 2)
BIT(ECE, 14)
BIT(ETP, 15)

extern volatile uint32_t TIM1_DIER;
extern volatile uint32_t TIM2_DIER;
extern volatile uint32_t TIM3_DIER;
extern volatile uint32_t TIM4_DIER;
extern volatile uint32_t TIM5_DIER;
extern volatile uint32_t TIM6_DIER;
extern volatile uint32_t TIM7_DIER;
extern volatile uint32_t TIM8_DIER;
extern volatile uint32_t TIM9_DIER;
extern volatile uint32_t TIM10_DIER;
extern volatile uint32_t TIM11_DIER;
extern volatile uint32_t TIM12_DIER;
extern volatile uint32_t TIM13_DIER;
extern volatile uint32_t TIM14_DIER;
BIT(UIE, 0)
BIT(CC1IE, 1)
BIT(CC2IE, 2)
BIT(CC3IE, 3)
BIT(CC4IE, 4)
BIT(COMIE, 5)
BIT(TIE, 6)
BIT(BIE, 7)
BIT(UDE, 8)
BIT(CC1DE, 9)
BIT(CC2DE, 10)
BIT(CC3DE, 11)
BIT(CC4DE, 12)
BIT(COMDE, 13)
BIT(TDE, 14)

extern volatile uint32_t TIM1_SR;
extern volatile uint32_t TIM2_SR;
extern volatile uint32_t TIM3_SR;
extern volatile uint32_t TIM4_SR;
extern volatile uint32_t TIM5_SR;
extern volatile uint32_t TIM6_SR;
extern volatile uint32_t TIM7_SR;
extern volatile uint32_t TIM8_SR;
extern volatile uint32_t TIM9_SR;
extern volatile uint32_t TIM10_SR;
extern volatile uint32_t TIM11_SR;
extern volatile uint32_t TIM12_SR;
extern volatile uint32_t TIM13_SR;
extern volatile uint32_t TIM14_SR;
BIT(UIF, 0)
BIT(CC1IF, 1)
BIT(CC2IF, 2)
BIT(CC3IF, 3)
BIT(CC4IF, 4)
BIT(COMIF, 5)
BIT(TIF, 6)
BIT(BIF, 7)
BIT(CC1OF, 9)
BIT(CC2OF, 10)
BIT(CC3OF, 11)
BIT(CC4OF, 12)

extern volatile uint32_t TIM1_EGR;
extern volatile uint32_t TIM2_EGR;
extern volatile uint32_t TIM3_EGR;
extern volatile uint32_t TIM4_EGR;
extern volatile uint32_t TIM5_EGR;
extern volatile uint32_t TIM6_EGR;
extern volatile uint32_t TIM7_EGR;
extern volatile uint32_t TIM8_EGR;
extern volatile uint32_t TIM9_EGR;
extern volatile uint32_t TIM10_EGR;
extern volatile uint32_t TIM11_EGR;
extern volatile uint32_t TIM12_EGR;
extern volatile uint32_t TIM13_EGR;
extern volatile uint32_t TIM14_EGR;
BIT(UG, 0)
BIT(CC1G, 1)
BIT(CC2G, 2)
BIT(CC3G, 3)
BIT(CC4G, 4)
BIT(COMG, 5)
BIT(TG, 6)
BIT(BG, 7)

extern volatile uint32_t TIM1_CCMR1;
extern volatile uint32_t TIM2_CCMR1;
extern volatile uint32_t TIM3_CCMR1;
extern volatile uint32_t TIM4_CCMR1;
extern volatile uint32_t TIM5_CCMR1;
extern volatile uint32_t TIM8_CCMR1;
extern volatile uint32_t TIM9_CCMR1;
extern volatile uint32_t TIM10_CCMR1;
extern volatile uint32_t TIM11_CCMR1;
extern volatile uint32_t TIM12_CCMR1;
extern volatile uint32_t TIM13_CCMR1;
extern volatile uint32_t TIM14_CCMR1;
BITS(CC1S, 0, 2)
BITS(IC1PSC, 2, 2)
BITS(IC1F, 4, 4)
BIT(OC1FE, 2)
BIT(OC1PE, 3)
BITS(OC1M, 4, 3)
BIT(OC1CE, 7)
BITS(CC2S, 8, 2)
BITS(IC2PSC, 10, 2)
BITS(IC2F, 12, 4)
BIT(OC2FE, 10)
BIT(OC2PE, 11)
BITS(OC2M, 12, 3)
BIT(OC2CE, 15)

extern volatile uint32_t TIM1_CCMR2;
extern volatile uint32_t TIM2_CCMR2;
extern volatile uint32_t TIM3_CCMR2;
extern volatile uint32_t TIM4_CCMR2;
extern volatile uint32_t TIM5_CCMR2;
extern volatile uint32_t TIM8_CCMR2;
BITS(CC3S, 0, 2)
BITS(IC3PSC, 2, 2)
BITS(IC3F, 4, 4)
BIT(OC3FE, 2)
BIT(OC3PE, 3)
BITS(OC3M, 4, 3)
BIT(OC3CE, 7)
BITS(CC4S, 8, 2)
BITS(IC4PSC, 10, 2)
BITS(IC4F, 12, 4)
BIT(OC4FE, 10)
BIT(OC4PE, 11)
BITS(OC4M, 12, 3)
BIT(OC4CE, 15)

extern volatile uint32_t TIM1_CCER;
extern volatile uint32_t TIM2_CCER;
extern volatile uint32_t TIM3_CCER;
extern volatile uint32_t TIM4_CCER;
extern volatile uint32_t TIM5_CCER;
extern volatile uint32_t TIM8_CCER;
extern volatile uint32_t TIM9_CCER;
extern volatile uint32_t TIM10_CCER;
extern volatile uint32_t TIM11_CCER;
extern volatile uint32_t TIM12_CCER;
extern volatile uint32_t TIM13_CCER;
extern volatile uint32_t TIM14_CCER;
BIT(CC1E, 0)
BIT(CC1P, 1)
BIT(CC1NE, 2)
BIT(CC1NP, 3)
BIT(CC2E, 4)
BIT(CC2P, 5)
BIT(CC2NE, 6)
BIT(CC2NP, 7)
BIT(CC3E, 8)
BIT(CC3P, 9)
BIT(CC3NE, 10)
BIT(CC3NP, 11)
BIT(CC4E, 12)
BIT(CC4P, 13)
BIT(CC4NP, 15)

extern volatile uint32_t TIM1_CNT;
extern volatile uint32_t TIM2_CNT;
extern volatile uint32_t TIM3_CNT;
extern volatile uint32_t TIM4_CNT;
extern volatile uint32_t TIM5_CNT;
extern volatile uint32_t TIM6_CNT;
extern volatile uint32_t TIM7_CNT;
extern volatile uint32_t TIM8_CNT;
extern volatile uint32_t TIM9_CNT;
extern volatile uint32_t TIM10_CNT;
extern volatile uint32_t TIM11_CNT;
extern volatile uint32_t TIM12_CNT;
extern volatile uint32_t TIM13_CNT;
extern volatile uint32_t TIM14_CNT;

extern volatile uint32_t TIM1_PSC;
extern volatile uint32_t TIM2_PSC;
extern volatile uint32_t TIM3_PSC;
extern volatile uint32_t TIM4_PSC;
extern volatile uint32_t TIM5_PSC;
extern volatile uint32_t TIM6_PSC;
extern volatile uint32_t TIM7_PSC;
extern volatile uint32_t TIM8_PSC;
extern volatile uint32_t TIM9_PSC;
extern volatile uint32_t TIM10_PSC;
extern volatile uint32_t TIM11_PSC;
extern volatile uint32_t TIM12_PSC;
extern volatile uint32_t TIM13_PSC;
extern volatile uint32_t TIM14_PSC;

extern volatile uint32_t TIM1_ARR;
extern volatile uint32_t TIM2_ARR;
extern volatile uint32_t TIM3_ARR;
extern volatile uint32_t TIM4_ARR;
extern volatile uint32_t TIM5_ARR;
extern volatile uint32_t TIM6_ARR;
extern volatile uint32_t TIM7_ARR;
extern volatile uint32_t TIM8_ARR;
extern volatile uint32_t TIM9_ARR;
extern volatile uint32_t TIM10_ARR;
extern volatile uint32_t TIM11_ARR;
extern volatile uint32_t TIM12_ARR;
extern volatile uint32_t TIM13_ARR;
extern volatile uint32_t TIM14_ARR;

extern volatile uint32_t TIM1_RCR;
extern volatile uint32_t TIM8_RCR;

extern volatile uint32_t TIM1_CCR1;
extern volatile uint32_t TIM2_CCR1;
extern volatile uint32_t TIM3_CCR1;
extern volatile uint32_t TIM4_CCR1;
extern volatile uint32_t TIM5_CCR1;
extern volatile uint32_t TIM8_CCR1;
extern volatile uint32_t TIM9_CCR1;
extern volatile uint32_t TIM10_CCR1;
extern volatile uint32_t TIM11_CCR1;
extern volatile uint32_t TIM12_CCR1;
extern volatile uint32_t TIM13_CCR1;
extern volatile uint32_t TIM14_CCR1;

